Revit 2027 API
CriticalPathCollector.GetCriticalPathCollectorIterator Method
 Gets the critical path iterator to traverse individual segment.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CriticalPathIterator GetCriticalPathCollectorIterator()
Public Function GetCriticalPathCollectorIterator As CriticalPathIterator
public:
CriticalPathIterator^ GetCriticalPathCollectorIterator()
member GetCriticalPathCollectorIterator : unit -> CriticalPathIterator
Return Value
CriticalPathIterator
 The iterator that traverses the critical path.
See Also
Reference
CriticalPathCollector Class
Autodesk.Revit.DB.Analysis Namespace